{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1", "userDefinedMetadata": {"signature": {"outputs": {"generated_image": {"name": "generated_image"}}}}, "modelTopology": {"node": [{"name": "conv2d_transpose_2/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_2/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose_1/input_sizes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "split_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "batchnorm_1/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose/input_sizes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "12544"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12544"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "12544"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Cast", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Squeeze_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "SparseToDense/default_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batchnorm_1/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Slice_1/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "batchnorm_2/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Slice_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_3/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "input.1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "100"}]}}}}, {"name": "SparseToDense", "op": "SparseToDense", "input": ["Squeeze_1", "Cast", "Squeeze_1", "SparseToDense/default_value"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "MatMul", "op": "MatMul", "input": ["input.1", "transpose"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add", "op": "AddV2", "input": ["Const", "SparseToDense"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "ExpandDims", "op": "ExpandDims", "input": ["MatMul", "ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "batchnorm/mul_1", "op": "Mul", "input": ["ExpandDims", "batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm/add_1", "op": "AddV2", "input": ["batchnorm/mul_1", "batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Squeeze", "op": "Squeeze", "input": ["batchnorm/add_1"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "LeakyRelu", "op": "LeakyRelu", "input": ["Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.009999999776482582}}}, {"name": "Reshape_4", "op": "Reshape", "input": ["LeakyRelu", "add"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "transpose_2", "op": "Transpose", "input": ["Reshape_4", "transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["conv2d_transpose/input_sizes", "split", "transpose_2"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Slice", "op": "Slice", "input": ["conv2d_transpose", "Slice/begin", "Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "transpose_3", "op": "Transpose", "input": ["Slice", "transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_1/mul_1", "op": "Mul", "input": ["batchnorm_1/mul", "transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_1/add_1", "op": "AddV2", "input": ["batchnorm_1/mul_1", "batchnorm_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "LeakyRelu_1", "op": "LeakyRelu", "input": ["batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.009999999776482582}}}, {"name": "transpose_5", "op": "Transpose", "input": ["LeakyRelu_1", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose_1", "op": "Conv2DBackpropInput", "input": ["conv2d_transpose_1/input_sizes", "split_2", "transpose_5"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Pad", "op": "Pad", "input": ["conv2d_transpose_1", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Slice_1", "op": "Slice", "input": ["Pad", "Slice/begin", "Slice_1/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "transpose_6", "op": "Transpose", "input": ["Slice_1", "transpose_3/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "batchnorm_2/mul_1", "op": "Mul", "input": ["batchnorm_2/mul", "transpose_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batchnorm_2/add_1", "op": "AddV2", "input": ["batchnorm_2/mul_1", "batchnorm_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "LeakyRelu_2", "op": "LeakyRelu", "input": ["batchnorm_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.009999999776482582}}}, {"name": "transpose_8", "op": "Transpose", "input": ["LeakyRelu_2", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "conv2d_transpose_2", "op": "Conv2DBackpropInput", "input": ["conv2d_transpose_2/input_sizes", "split_4", "transpose_8"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Pad_1", "op": "Pad", "input": ["conv2d_transpose_2", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "Slice_2", "op": "Slice", "input": ["Pad_1", "Slice/begin", "Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "transpose_9", "op": "Transpose", "input": ["Slice_2", "transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "generated_image", "op": "Tanh", "input": ["transpose_9"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "conv2d_transpose_2/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "split_4", "shape": [5, 5, 1, 64], "dtype": "float32"}, {"name": "batchnorm_2/mul", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "conv2d_transpose_1/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "split_2", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "batchnorm_1/mul", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "conv2d_transpose/input_sizes", "shape": [4], "dtype": "int32"}, {"name": "split", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "transpose", "shape": [100, 12544], "dtype": "float32"}, {"name": "ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "batchnorm/mul", "shape": [1, 12544, 1], "dtype": "float32"}, {"name": "batchnorm/sub", "shape": [1, 12544, 1], "dtype": "float32"}, {"name": "Const", "shape": [4], "dtype": "int32"}, {"name": "Cast", "shape": [1], "dtype": "int32"}, {"name": "Squeeze_1", "shape": [0], "dtype": "int32"}, {"name": "SparseToDense/default_value", "shape": [], "dtype": "int32"}, {"name": "Slice/size", "shape": [4], "dtype": "int32"}, {"name": "batchnorm_1/sub", "shape": [1, 128, 1, 1], "dtype": "float32"}, {"name": "Slice_1/size", "shape": [4], "dtype": "int32"}, {"name": "batchnorm_2/sub", "shape": [1, 64, 1, 1], "dtype": "float32"}, {"name": "transpose_2/perm", "shape": [4], "dtype": "int32"}, {"name": "Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "Slice/begin", "shape": [4], "dtype": "int32"}, {"name": "Slice_2/size", "shape": [4], "dtype": "int32"}, {"name": "transpose_3/perm", "shape": [4], "dtype": "int32"}]}]}